Reports/дог_АнализИсполненияСроковПоставокПоДоговору.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>дог_АнализИсполненияСроковПоставокПоДоговору</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаАктуальности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/дог_АнализИсполненияСроковПоставокПоДоговору/Ext/ObjectModule.bsl
Перем ДанныеРасшифровки Экспорт;
Перем СохраненнаяНастройка Экспорт;
Перем мСписокСтруктурныхЕдиниц Экспорт;
Перем мДеревоСтруктурныхЕдиниц Экспорт;
Перем мСписокПодразделений Экспорт;

Процедура Скомпоновать(ДокументРезультат,ДеревоСЕ,СписокСЕ,СписокПодразделений) Экспорт
	мСписокПодразделений = СписокПодразделений;
	мСписокСтруктурныхЕдиниц = СписокСЕ;
	мДеревоСтруктурныхЕдиниц = ДеревоСЕ;
	СкомпоноватьРезультат(ДокументРезультат,ДанныеРасшифровки);	
	общ_СтандартныеОтчетыСервер.НастроитьФиксацию(ДокументРезультат,КомпоновщикНастроек.Настройки);
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	Для Каждого Реквизит Из Метаданные().Реквизиты Цикл
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(Реквизит.Имя,?(Реквизит.Имя="ДатаАктуальности" И ДатаАктуальности<>'00010101',КонецДня(ДатаАктуальности),ЭтотОбъект[Реквизит.Имя]));
	КонецЦикла;
	Отчеты.дог_АнализИсполненияСроковПоставокПоДоговору.ДоработатьКомпоновщикПередВыводом(КомпоновщикНастроек,ОтображатьДанныеПоПодчиненнымДоговорамКонтрагента,ДоговорКонтрагента,мСписокСтруктурныхЕдиниц,мСписокПодразделений,мДеревоСтруктурныхЕдиниц);
КонецПроцедуры
